% Поиск Шурина (брата жены)

%shurin
shurin(Husb, Bro) :- wife(Husb, Wife), brother(Wife, Bro).

% wife
wife(X, T) :- father(X, L), mother(T, L).

% brother
brother(X, Z) :- (father(Y, X), father(Y, Z); mother(T, X), mother(T, Z)), male(Z), X \= Z.

?- ['royal.pl'].
%@ true.

?- shurin('Алексей Петрович Кропоткин', T).
%@ T = 'Алексей Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский' ;
%@ T = 'Алексей Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский' ;
%@ T = 'Алексей Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский' ;
%@ T = 'Михаил Алексеевич Оболенский'.

?- shurin(X, Y).
%@ X = Y, Y = 'Аарон Болгарский' ;
%@ X = 'Аарон Болгарский',
%@ Y = 'Алузиан Болгарский' ;
%@ X = 'Аарон Болгарский',
%@ Y = 'Радомир Болгарский' ;
%@ X = 'Аарон Болгарский',
%@ Y = 'Траян Болгарский' ;
%@ X = 'Аарон Болгарский',
%@ Y = 'Фрушин Болгарский' .
